TransportManagementDevelop_KAT/Конфигурация/src/InformationRegisters/гкс_ИдентификаторыСинхронизируемыхОбъектов/гкс_ИдентификаторыСинхронизируемыхОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гкс_ИдентификаторыСинхронизируемыхОбъектов</name>
  <dimensions>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Ссылка</name>
    <type>
      <types>DocumentRef</types>
      <types>ChartOfCharacteristicTypesRef</types>
      <types>CatalogRef</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Приложение</name>
    <type>
      <types>CatalogRef.гкс_УчастникиОбменаRMQ</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

TransportManagementDevelop_KAT/Конфигурация/src/InformationRegisters/гкс_ИдентификаторыСинхронизируемыхОбъектов/Forms/ФормаЗаписи/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Шаблон = НСтр("ru='Изменение связи. До: 
                  | Идентификатор: %1
				  | Ссылка: %2
				  | Приложение: %3'");
	
	Информация = гкс_СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Шаблон,
	                                                                         ТекущийОбъект.Идентификатор,
																             Строка(ТекущийОбъект.Ссылка),
																             Строка(ТекущийОбъект.Приложение));	
	гкс_ОчередьСообщенийRMQ.ЗаписьИнформацииВЖурналРегистрации(Информация,
															   НСтр("ru='ИзменениеСвязи'"),
															   ТекущийОбъект.Ссылка.Метаданные(),
															   ТекущийОбъект.Ссылка);
	
КонецПроцедуры           

#КонецОбласти
